app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "voto" = ?, "updated_at" = ? WHERE "artworks"."id" = ?  [["voto", 35], ["updated_at", "2020-06-27 14:52:02.351889"], ["id", 4]]
UPDATE "artworks" SET "valutazioni" = ?, "updated_at" = ? WHERE "artworks"."id" = ?  [["valutazioni", 66], ["updated_at", "2020-06-27 15:17:47.934603"], ["id", 4]]
---
    def update_mark
        @artwork = Artwork.find(params[:id])
        @mark = Integer(params[:mark])

        @nuovoVoto = ((@artwork.voto + @mark)/2.0).ceil
        @nuovaValutazione = @artwork.valutazioni + 1

        @artwork.update_attribute(:voto, @nuovoVoto)
        @artwork.update_attribute(:valutazioni, @nuovaValutazione)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def more_infos
        @artwork = Artwork.find(params[:id]).nome + '.txt'