app/controllers/visit_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def new
        @artworks = Artwork.all